//
//  Event.swift
//  Efemerides
//
//  Created by Denis Denisov on 5/3/24.
//
import Foundation

struct Event {
    let title: String
    let description: String
    let Date: Date
}

let events = [
    (
        title: "Вступление в силу Версальского мирного договора",
        description: "10 января 1920 года Версальский мирный договор вступает в силу, официально завершая Первую мировую войну.",
        date: "10.01.1920"
    ),
    (
        title: "Использование инсулина в лечении диабета",
        description: "11 января 1922 года инсулин впервые применяется для лечения диабета у человека.",
        date: "11.01.1922"
    ),
    (
        title: "Отклонение законопроекта о предоставлении женщинам права голоса",
        description: "12 января 1915 года Палата представителей США отклоняет законопроект о предоставлении женщинам права голоса.",
        date: "12.01.1915"
    ),
    (
        title: "Публикация письма 'Я обвиняю'",
        description: "13 января 1898 года было опубликовано письмо Эмиля Золя 'Я обвиняю', в котором он обвинял французское правительство в антисемитизме и несправедливости.",
        date: "13.01.1898"
    ),
    (
        title: "Принятие 'Основных порядков'",
        description: "14 января 1639 года в Коннектикуте были приняты 'Основные порядки', первая писаная конституция в Америке.",
        date: "14.01.1639"
    ),
    (
        title: "Запуск сайта Википедия",
        description: "15 января 2001 года начинает работу сайт Википедия, позволяющий пользователям свободно редактировать его содержание.",
        date: "15.01.2001"
    ),
    (
        title: "Начало Персидской войны",
        description: "16 января 1991 года начинается Персидская война с воздушных налетов сил коалиции под командованием США на Ирак.",
        date: "16.01.1991"
    ),
    (
        title: "Рождение Бенджамина Франклина",
        description: "17 января 1706 года в Бостоне, Массачусетс, рождается Бенджамин Франклин, один из Основателей Соединенных Штатов.",
        date: "17.01.1706"
    ),
    (
        title: "Открытие Парижской мирной конференции",
        description: "18 января 1919 года открывается Парижская мирная конференция, которая приводит к подписанию Третьего Парижского мирного договора и завершению Первой мировой войны.",
        date: "18.01.1919"
    ),
    (
        title: "Рождение Эдгара Аллана По",
        description: "19 января 1809 года в Бостоне, Массачусетс, рождается Эдгар Аллан По, американский писатель и поэт.",
        date: "19.01.1809"
    ),
    (
        title: "Созыв первого английского парламента",
        description: "20 января 1265 года в Вестминстер-Холле состоялся созыв первого английского парламента под руководством Саймона де Монфорта.",
        date: "20.01.1265"
    ),
    (
        title: "Казнь короля Людовика XVI",
        description: "21 января 1793 года во время Французской революции король Франции Людовик XVI был казнен на гильотине.",
        date: "21.01.1793"
    ),
